{
  "1John:3:4": {
    "footnotes": [
      "The Greek anomia means 'lawlessness'—rebellion against God's law, not merely 'iniquity' in a vague sense.",
      "Sin is defined as transgression of the divine law. This objective definition refutes subjective notions of sin."
    ]
  },
  "1John:1:9": {
    "footnotes": [
      "'If we confess our sins, he is faithful and just, to forgive us our sins'—confession is the condition for forgiveness.",
      "This verse grounds the practice of sacramental confession: sins must be acknowledged to be forgiven."
    ]
  },
  "1John:2:2": {
    "footnotes": [
      "'He is the propitiation for our sins: and not for ours only, but also for those of the whole world.'",
      "Christ's atonement is universal in scope—sufficient for all—though its application requires faith and repentance."
    ]
  },
  "1John:4:2": {
    "footnotes": [
      "'Every spirit which confesseth that Jesus Christ is come in the flesh, is of God'—the test of orthodoxy is confessing the Incarnation.",
      "Denial that Christ came 'in the flesh' is the spirit of Antichrist (v. 3). Docetism and Gnosticism are condemned."
    ]
  },
  "1John:5:7": {
    "footnotes": [
      "'There are three who give testimony in heaven, the Father, the Word, and the Holy Ghost. And these three are one.'",
      "The Comma Johanneum—this Trinitarian formula is in the Vulgate and Clementine text but absent from most Greek manuscripts.",
      "Its canonicity has been debated; the Council of Trent's decree did not settle the textual question definitively."
    ]
  },
  "1John:5:16": {
    "footnotes": [
      "'There is a sin unto death'—mortal sin, which kills the life of grace in the soul.",
      "John distinguishes sins 'unto death' from sins 'not unto death'—the basis for the distinction between mortal and venial sin.",
      "For mortal sin, John says he does not say one should pray—indicating its gravity; yet even mortal sin can be forgiven through repentance and confession."
    ]
  },
  "1John:5:17": {
    "footnotes": [
      "'All iniquity is sin. And there is a sin unto death'—not all sins are equal. Some sins kill the soul's life of grace (mortal), others wound but do not kill (venial)."
    ]
  }
}
