{
  "2Macc:12:43": {
    "footnotes": [
      "Judas Machabeus collects money to send to Jerusalem for a sin-offering on behalf of the fallen soldiers.",
      "This action presupposes that prayers and sacrifices for the dead can benefit them—a practice incompatible with immediate final judgment for all."
    ]
  },
  "2Macc:12:44": {
    "footnotes": [
      "'It is therefore a holy and wholesome thought to pray for the dead, that they may be loosed from sins.'",
      "This verse directly states the doctrine of purgatory and prayers for the dead.",
      "Council of Trent, Session XXV: 'The souls detained [in purgatory] are helped by the suffrages of the faithful and especially by the acceptable sacrifice of the altar.'"
    ]
  },
  "2Macc:12:45": {
    "footnotes": [
      "'He thought of the resurrection'—Judas's action demonstrates Jewish belief in resurrection and in the possibility of post-mortem purification.",
      "The passage refutes both annihilationism and the notion that the dead are beyond all help."
    ]
  },
  "2Macc:12:46": {
    "footnotes": [
      "The inspired author commends Judas's action as 'holy and wholesome,' giving divine sanction to prayers for the dead.",
      "Protestant removal of 2 Machabees from the canon correlates historically with rejection of purgatory and prayers for the dead."
    ]
  },
  "2Macc:7:9": {
    "footnotes": [
      "'The King of the world will raise us up, who die for his laws, in the resurrection of eternal life.'",
      "Clear testimony to bodily resurrection in pre-Christian Judaism, demonstrating this doctrine was not a Christian innovation."
    ]
  },
  "2Macc:7:14": {
    "footnotes": [
      "'It is better, being put to death by men, to look for hope from God, to be raised up again by him.'",
      "The seven brothers explicitly affirm resurrection as the ground of their martyrdom."
    ]
  },
  "2Macc:15:14": {
    "footnotes": [
      "The deceased prophet Jeremias prays for the people and the holy city—demonstrating that the righteous dead intercede for the living.",
      "This refutes the claim that invoking saints is unbiblical or necromantic."
    ]
  }
}
