{
  "Rev:12:1": {
    "footnotes": [
      "The 'woman clothed with the sun' is interpreted as: (1) the Church, (2) Israel, and (3) Mary, the Mother of the Messiah.",
      "These interpretations are not mutually exclusive but represent layers of meaning in apocalyptic symbolism.",
      "The Marian interpretation sees Mary as the Queen of Heaven, crowned with twelve stars representing the twelve tribes/apostles.",
      "Pius XII, Munificentissimus Deus (1950): This passage supports the doctrine of Mary's Assumption and heavenly glorification."
    ]
  },
  "Rev:12:2": {
    "footnotes": [
      "The woman's travail represents either the Church's birth-pangs in bringing forth Christ's members, or Mary's spiritual anguish at the Cross.",
      "Traditional teaching holds that Mary's physical childbirth was painless, being free from the curse of Genesis 3:16."
    ]
  },
  "Rev:12:5": {
    "footnotes": [
      "'A man child, who was to rule all nations with an iron rod'—this is clearly Christ, the Messiah (cf. Ps 2:9).",
      "The woman who bears Him is therefore, in one sense, Mary—confirming the Marian interpretation of the vision."
    ]
  },
  "Rev:12:17": {
    "footnotes": [
      "'The rest of her seed'—if the woman is Mary, her other offspring are Christians, her spiritual children.",
      "Christ gives Mary as mother to all disciples (John 19:27), making all believers her children."
    ]
  },
  "Rev:5:8": {
    "footnotes": [
      "'Golden vials full of odours, which are the prayers of the saints'—the saints in heaven offer the prayers of the faithful to God.",
      "This demonstrates the intercessory role of the saints and refutes objections to their invocation."
    ]
  },
  "Rev:8:3": {
    "footnotes": [
      "An angel offers incense 'with the prayers of all saints upon the golden altar'—heavenly beings participate in presenting prayers to God.",
      "If angels present prayers, how much more do the saints who share in Christ's priestly ministry?"
    ]
  },
  "Rev:20:12": {
    "footnotes": [
      "'The dead were judged... according to their works'—final judgment is by works, not by faith alone.",
      "Cf. Matt 25:31-46; Rom 2:6; 2 Cor 5:10."
    ]
  }
}
