{
  "Col:1:15": {
    "footnotes": [
      "'The image of the invisible God' (eikōn tou theou)—Christ is not a created copy but the perfect manifestation of the Father. 'He who sees me sees the Father' (John 14:9).",
      "'Firstborn of every creature'—'firstborn' (prōtotokos) denotes supremacy and sovereignty, not temporal origin. The heir of all creation, not a creature.",
      "Cf. Psalm 89:27: 'I will make him my firstborn, the highest of the kings of the earth.' Firstborn = supreme rank."
    ]
  },
  "Col:1:16": {
    "footnotes": [
      "'In him were all things created'—Christ is the sphere, agent, and goal of all creation. Nothing exists apart from Him.",
      "'Thrones, dominations, principalities, powers'—the entire angelic hierarchy owes its existence to Christ, refuting the Colossian heresy that elevated angels.",
      "'All things were created by him and for him'—creation has a Christological purpose; it exists for Christ's glory."
    ]
  },
  "Col:1:17": {
    "footnotes": [
      "'He is before all things'—eternal pre-existence, not merely temporal priority. Christ exists outside and prior to creation.",
      "'In him all things hold together' (synestēken)—Christ is the sustaining principle of the universe. He maintains cosmic order moment by moment."
    ]
  },
  "Col:1:18": {
    "footnotes": [
      "'The head of the body, the church'—Christ's cosmic lordship culminates in His headship over the Church, which is His body.",
      "'The beginning, the firstborn from the dead'—Christ's resurrection is the firstfruits (1 Cor 15:20), the beginning of the new creation.",
      "'That in all things he may hold the primacy'—the purpose of the Incarnation: Christ's absolute supremacy in every sphere."
    ]
  },
  "Col:1:19": {
    "footnotes": [
      "'All the fulness should dwell' (pan to plērōma)—the totality of divine being inhabits Christ bodily. Against Gnostic ideas of partial divine emanations."
    ]
  },
  "Col:1:20": {
    "footnotes": [
      "'To reconcile all things... through the blood of his cross'—cosmic redemption. The Cross affects not only humanity but the entire created order.",
      "'Things on earth and things in heaven'—the scope of reconciliation is universal, extending to the spiritual realm."
    ]
  },
  "Col:2:9": {
    "footnotes": [
      "'In him dwelleth all the fulness of the Godhead corporeally' (sōmatikōs)—the most explicit statement of Christ's full divinity. The complete divine nature dwells in His physical body.",
      "This verse definitively refutes Arianism, Gnosticism, and any diminution of Christ's divinity."
    ]
  }
}
