{
  "Dan:2:34": {
    "footnotes": [
      "'A stone was cut out of a mountain without hands'—the stone not cut by human hands represents the kingdom of God, established by divine power alone.",
      "Christ is the cornerstone rejected by the builders (Matt 21:42-44); His kingdom crushes all earthly empires."
    ]
  },
  "Dan:2:44": {
    "footnotes": [
      "'The God of heaven will set up a kingdom that shall never be destroyed'—the Church, established in the Roman era, endures forever.",
      "Unlike Babylon, Persia, Greece, and Rome, which fell, Christ's kingdom is eternal."
    ]
  },
  "Dan:7:9": {
    "footnotes": [
      "'The Ancient of days sat'—a vision of God the Father enthroned in glory. The 'ancient' emphasizes eternity.",
      "The white garments and fiery throne reveal divine majesty and judgment."
    ]
  },
  "Dan:7:13": {
    "footnotes": [
      "'One like the son of man came with the clouds of heaven'—the most important title Jesus uses for Himself, occurring 80+ times in the Gospels.",
      "'Son of Man' is not a title of humility but of divine glory: this figure approaches the Ancient of Days and receives universal, eternal dominion.",
      "At His trial, Jesus quotes this verse (Matt 26:64), and the high priest tears his robes, understanding the divine claim."
    ]
  },
  "Dan:7:14": {
    "footnotes": [
      "'He gave him power, and glory, and a kingdom'—the Son of Man receives from the Father a kingdom that is universal ('all peoples, nations, languages'), everlasting, and indestructible.",
      "This is not a mere human messiah but a divine figure sharing the Father's throne and receiving worship."
    ]
  },
  "Dan:9:24": {
    "footnotes": [
      "'Seventy weeks are shortened upon thy people... to make an end of sins'—the prophecy of seventy 'weeks' (490 years) culminating in the Messiah's atoning work.",
      "'To anoint the most Holy'—the Anointed One (Mashiach) who accomplishes eternal redemption."
    ]
  },
  "Dan:9:26": {
    "footnotes": [
      "'Christ shall be slain: and the people that shall deny him shall not be his'—the Messiah will be 'cut off' (killed), and Jerusalem will be destroyed.",
      "Fulfilled in AD 30 (Christ's death) and AD 70 (Jerusalem's destruction). The timing corresponds to the prophecy."
    ]
  },
  "Dan:12:2": {
    "footnotes": [
      "'Many of those that sleep in the dust of the earth, shall awake: some unto life everlasting, and others unto reproach'—clear OT teaching on bodily resurrection and final judgment.",
      "The resurrection is to 'everlasting life' or 'everlasting contempt'—heaven or hell, with no middle ground for the finally impenitent."
    ]
  }
}
