{
  "Exod:3:14": {
    "footnotes": [
      "'I AM WHO AM' (ehyeh asher ehyeh)—the divine name revealed to Moses, indicating God's eternal, self-existent being.",
      "Jesus claims this name for Himself (John 8:58: 'Before Abraham was, I AM'), asserting His divinity."
    ]
  },
  "Exod:12:3": {
    "footnotes": [
      "'A lamb by their families and houses'—the Passover lamb must be for each household, establishing the family as the basic unit of salvation."
    ]
  },
  "Exod:12:5": {
    "footnotes": [
      "'A lamb without blemish'—the requirement of perfection points to Christ, the spotless Lamb of God (1 Pet 1:19)."
    ]
  },
  "Exod:12:6": {
    "footnotes": [
      "'The whole multitude of the children of Israel shall sacrifice it in the evening'—Jesus is crucified on the day of Passover, at the hour when the lambs were being slaughtered in the Temple."
    ]
  },
  "Exod:12:7": {
    "footnotes": [
      "'They shall take of the blood, and put it upon both the side posts, and on the upper door posts'—the blood marks a cross shape on the doorframe.",
      "St. Justin Martyr and other Fathers saw in this the sign of the Cross that saves from death."
    ]
  },
  "Exod:12:11": {
    "footnotes": [
      "'It is the Phase (that is the Passage) of the Lord'—Pascha means 'passing over.' Christ, our Passover, passes from death to life and brings us with Him."
    ]
  },
  "Exod:12:13": {
    "footnotes": [
      "'The blood shall be unto you for a sign... and the plague shall not be upon you'—the blood of the lamb protects from death. So Christ's blood delivers from eternal death.",
      "The Passover is not merely commemorated but participated in; likewise the Eucharist makes present Christ's sacrifice."
    ]
  },
  "Exod:12:46": {
    "footnotes": [
      "'Neither shall you break a bone thereof'—fulfilled in Christ: 'they did not break his legs' (John 19:33, 36). The Paschal Lamb's bones remain unbroken."
    ]
  },
  "Exod:14:22": {
    "footnotes": [
      "'The children of Israel went in through the midst of the sea dried up'—the Red Sea crossing is a type of baptism (1 Cor 10:1-2).",
      "Through water, Israel passed from slavery to freedom; through baptism, Christians pass from sin to new life."
    ]
  },
  "Exod:16:4": {
    "footnotes": [
      "'I will rain bread from heaven'—the manna prefigures the Eucharist, the true bread from heaven.",
      "Jesus makes this connection explicit: 'Moses gave you not bread from heaven, but my Father giveth you the true bread from heaven' (John 6:32)."
    ]
  },
  "Exod:16:15": {
    "footnotes": [
      "'Man-hu?' ('What is this?')—from which 'manna' derives. The mysterious bread from heaven anticipates the mystery of Christ's presence in the Eucharist."
    ]
  },
  "Exod:17:6": {
    "footnotes": [
      "'Thou shalt strike the rock, and water shall come out'—the rock is Christ (1 Cor 10:4). Struck once, He becomes the source of living water.",
      "St. Augustine: 'The rock was Christ in sign; the true Christ is in the Word and in the flesh.'"
    ]
  },
  "Exod:24:8": {
    "footnotes": [
      "'This is the blood of the covenant which the Lord hath made with you'—Moses sprinkles blood to ratify the covenant.",
      "At the Last Supper, Jesus echoes these words: 'This is my blood of the new testament' (Matt 26:28). The new covenant is sealed in His blood."
    ]
  },
  "Exod:25:8": {
    "footnotes": [
      "'They shall make me a sanctuary, and I will dwell in the midst of them'—God desires to dwell among His people.",
      "This finds ultimate fulfillment in the Incarnation: 'The Word was made flesh and dwelt among us' (John 1:14, lit. 'tabernacled')."
    ]
  },
  "Exod:34:6": {
    "footnotes": [
      "'Merciful and gracious, patient and of much compassion, and true'—the divine self-revelation to Moses.",
      "'Grace and truth' (chesed we'emet) appears in John 1:14 describing Christ, identifying Jesus with Yahweh who revealed Himself to Moses."
    ]
  }
}
