{
  "Gal:2:16": {
    "footnotes": [
      "'Not justified by the works of the law, but by the faith of Jesus Christ'—'works of the law' refers to Mosaic ceremonial observances (circumcision, dietary laws), not to moral works flowing from faith.",
      "The context is the Judaizing controversy: must Gentiles become Jews to be saved? Paul answers no."
    ]
  },
  "Gal:2:20": {
    "footnotes": [
      "'I live, now not I; but Christ liveth in me'—justification involves a real indwelling of Christ, transforming the believer, not merely a legal declaration."
    ]
  },
  "Gal:3:27": {
    "footnotes": [
      "'As many of you as have been baptized in Christ, have put on Christ'—baptism effects a real 'putting on' of Christ, a true incorporation into His Body.",
      "This sacramental realism undergirds the efficacy of baptism for justification."
    ]
  },
  "Gal:5:6": {
    "footnotes": [
      "'Faith which worketh by charity' (fides quae per caritatem operatur)—the key synthesis of Paul and James: saving faith is faith animated by love, which necessarily produces works.",
      "St. Augustine, De Trinitate XV.18: 'This is the faith that distinguishes the faithful of God from unclean demons.'",
      "Council of Trent, Session VI, Chapter 7: We are justified by 'faith, hope, and charity.'"
    ]
  },
  "Gal:5:19": {
    "footnotes": [
      "The 'works of the flesh' enumerated here can exclude from the kingdom (v. 21), indicating that one can lose justification through grave sin."
    ]
  },
  "Gal:5:21": {
    "footnotes": [
      "'They who do such things shall not obtain the kingdom of God'—mortal sin (grave matter, full knowledge, deliberate consent) excludes from salvation.",
      "This list provides examples of sins that, if unrepented, damn—proving justification can be lost."
    ]
  },
  "Gal:6:8": {
    "footnotes": [
      "'He that soweth in the flesh, of the flesh also shall reap corruption. But he that soweth in the spirit, of the spirit shall reap life everlasting.'",
      "Final salvation depends on how one lives—'sowing in the spirit' through works of charity and virtue."
    ]
  }
}
