{
  "Gen:1:1": {
    "footnotes": [
      "Hebrew 'shamayim' is plural, emphasizing the totality of the created cosmos."
    ]
  },
  "Gen:1:2": {
    "footnotes": [
      "The 'Spirit of God' (Heb. ruach Elohim) moving over the waters prefigures the sacramental action of baptism."
    ]
  },
  "Gen:1:26": {
    "footnotes": [
      "The plural 'Let us make' has been understood by the Fathers as an indication of the Trinity.",
      "Cf. St. Augustine, De Trinitate I.7"
    ]
  },
  "Gen:3:15": {
    "footnotes": [
      "The Protoevangelium (First Gospel): the earliest prophecy of the Redeemer and His Mother.",
      "The Vulgate reads 'ipsa conteret' (she shall crush), interpreting the woman as instrumental in the serpent's defeat through her seed, Christ.",
      "The 'woman' is both Eve and, in the fuller sense, Mary—the New Eve who brings forth the New Adam.",
      "St. Irenaeus, Adv. Haer. III.22.4: 'The knot of Eve's disobedience was loosed by Mary's obedience.'",
      "The enmity between the woman and the serpent implies Mary's complete freedom from Satan's dominion—the Immaculate Conception."
    ]
  },
  "Gen:14:18": {
    "footnotes": [
      "'Melchisedech the king of Salem, bringing forth bread and wine, for he was the priest of the most high God.'",
      "Melchizedek is a priest-king who offers bread and wine—a type of Christ who offers His Body and Blood under the species of bread and wine.",
      "Hebrews 7 develops this typology: Christ is 'a priest forever according to the order of Melchisedech,' superseding the Levitical priesthood.",
      "The Eucharistic overtones are unmistakable: the offering of bread and wine by a priest who blesses."
    ]
  },
  "Gen:22:2": {
    "footnotes": [
      "'Take thy only begotten son Isaac, whom thou lovest'—the language anticipates John 3:16: God's only-begotten Son, whom He loves.",
      "'The land of vision... upon one of the mountains'—Jewish tradition identifies this with Mount Moriah, the site of the Temple, and Calvary."
    ]
  },
  "Gen:22:6": {
    "footnotes": [
      "'He laid the wood for the holocaust upon Isaac his son'—Isaac carries the wood of his own sacrifice, as Christ carries His cross to Golgotha.",
      "The Fathers universally see Isaac as a type of Christ: the beloved son, obedient unto death."
    ]
  },
  "Gen:22:8": {
    "footnotes": [
      "'God will provide himself a victim for an holocaust'—prophetic words fulfilled in Christ, the Lamb provided by God Himself.",
      "The ram caught in the thicket (v. 13) becomes the substitute sacrifice, foreshadowing how Christ substitutes for sinners."
    ]
  },
  "Gen:22:12": {
    "footnotes": [
      "'Thou hast not spared thy only begotten son for my sake'—Paul echoes this in Romans 8:32: God 'spared not his own Son.'",
      "Abraham's willingness to sacrifice Isaac typifies the Father's gift of His Son on the Cross."
    ]
  },
  "Gen:22:14": {
    "footnotes": [
      "'The Lord will provide' (Yahweh-Yireh)—the name Abraham gives to the place, fulfilled when God provides the true sacrifice on this same mountain."
    ]
  },
  "Gen:28:12": {
    "footnotes": [
      "'A ladder standing upon the earth, and the top thereof touching heaven'—Jacob's ladder prefigures Christ, the one mediator between heaven and earth.",
      "Christ Himself applies this typology: 'You shall see the angels of God ascending and descending upon the Son of man' (John 1:51)."
    ]
  }
}
