{
  "Heb:1:1": {
    "footnotes": [
      "'God, who at sundry times and in divers manners'—revelation was partial and progressive in the Old Testament, through prophets, theophanies, and types.",
      "The contrast: many times, many ways (OT) versus once and perfectly (Christ)."
    ]
  },
  "Heb:1:2": {
    "footnotes": [
      "'In these last days hath spoken to us by his Son'—the definitive, final revelation is not a book or a doctrine but a Person.",
      "'By whom also he made the world'—the Son is the agent of creation (cf. John 1:3, Col 1:16). He is not a creature but Creator."
    ]
  },
  "Heb:1:3": {
    "footnotes": [
      "'The radiance of his glory' (apaugasma tēs doxēs)—Christ is the effulgence of the Father's glory, eternally emanating from Him like light from the sun.",
      "'The exact imprint of his being' (charaktēr tēs hypostaseōs)—the Son perfectly expresses the Father's very substance. He is homoousios (same substance) with the Father.",
      "'Upholding all things by the word of his power'—Christ sustains the universe in existence moment by moment. Creation depends on His continuous will.",
      "'Purgation of sins... sat down on the right hand'—the priestly and kingly offices united. Having completed His sacrifice, He reigns forever."
    ]
  },
  "Heb:1:6": {
    "footnotes": [
      "'Let all the angels of God adore him'—quoting Deuteronomy 32:43 (LXX). Angels worship the Son, proving He is not an angel but God. Worship belongs to God alone."
    ]
  },
  "Heb:1:8": {
    "footnotes": [
      "'Thy throne, O God, is for ever and ever'—the Father addresses the Son as 'God' (ho theos). A direct scriptural assertion of Christ's divinity from Psalm 45:6-7."
    ]
  },
  "Heb:1:10": {
    "footnotes": [
      "'Thou, Lord, in the beginning didst found the earth'—quoting Psalm 102:25-27, which speaks of Yahweh, and applying it to Christ. The Son is Yahweh."
    ]
  },
  "Heb:4:12": {
    "footnotes": [
      "'The word of God is living and effectual'—Scripture is not dead letter but living, active, and powerful.",
      "'More piercing than any two-edged sword'—it penetrates to the deepest levels of human interiority, exposing hidden motives and thoughts.",
      "'Reaching unto the division of the soul and the spirit'—the word discerns between psychē (natural life) and pneuma (spiritual life), revealing what is truly of God."
    ]
  },
  "Heb:4:15": {
    "footnotes": [
      "'Tempted in all things like as we are, without sin'—Christ experienced the full range of human trial and temptation, yet never sinned. His sympathy is based on real experience.",
      "His sinlessness qualifies Him to be our perfect high priest and sacrifice."
    ]
  },
  "Heb:5:6": {
    "footnotes": [
      "'A priest for ever according to the order of Melchisedech'—Christ's priesthood is not Levitical but follows the mysterious Melchizedek of Genesis 14.",
      "Unlike Levitical priests, Christ's priesthood is eternal and not dependent on physical descent."
    ]
  },
  "Heb:7:3": {
    "footnotes": [
      "'Without father, without mother, without genealogy'—Melchizedek appears in Genesis without recorded origin or end, making him a type of the eternal Son.",
      "'Likened unto the Son of God, continueth a priest for ever'—the typology: Melchizedek foreshadows Christ's eternal, non-Levitical priesthood."
    ]
  },
  "Heb:7:25": {
    "footnotes": [
      "'He is able also to save for ever them that come to God by him'—Christ's saving power is complete and eternal, not partial or temporary.",
      "'Always living to make intercession for them'—Christ's high priestly ministry continues in heaven. He perpetually intercedes for His people."
    ]
  },
  "Heb:9:22": {
    "footnotes": [
      "'Without shedding of blood there is no remission'—the necessity of blood sacrifice for atonement, fulfilled definitively in Christ's death."
    ]
  },
  "Heb:9:27": {
    "footnotes": [
      "'It is appointed unto men once to die, and after this the judgment'—death is universal, and judgment follows. No reincarnation; human life is singular and decisive."
    ]
  },
  "Heb:10:5": {
    "footnotes": [
      "'A body thou hast fitted to me'—the Incarnation was precisely so that Christ could offer the sacrifice of His body, which animal sacrifices could never accomplish."
    ]
  },
  "Heb:10:12": {
    "footnotes": [
      "'One sacrifice for sins... for ever'—Christ's sacrifice is unrepeatable and eternally efficacious. The Mass does not re-sacrifice but makes present this one sacrifice."
    ]
  },
  "Heb:11:1": {
    "footnotes": [
      "'Faith is the substance of things to be hoped for'—faith is not wishful thinking but the real foundation (hypostasis) that makes future realities present.",
      "'The evidence of things that appear not'—faith provides conviction (elenchos) about unseen divine realities, a form of spiritual knowledge."
    ]
  },
  "Heb:12:1": {
    "footnotes": [
      "'So great a cloud of witnesses'—the saints of Chapter 11 surround believers, not as passive spectators but as an encouraging communion.",
      "The communion of saints: the Church Triumphant remains connected to the Church Militant."
    ]
  },
  "Heb:12:29": {
    "footnotes": [
      "'Our God is a consuming fire'—quoting Deuteronomy 4:24. God's holiness purifies and consumes all that is incompatible with His nature. This informs the doctrine of purgatory."
    ]
  }
}
