{
  "Isa:7:14": {
    "footnotes": [
      "'Behold a virgin shall conceive, and bear a son, and his name shall be called Emmanuel.'",
      "The Hebrew 'almah' means 'young woman of marriageable age'; the LXX translates as parthenos (virgin), which Matthew 1:23 follows.",
      "Emmanuel = 'God with us.' The child born of the virgin is God incarnate, dwelling among His people."
    ]
  },
  "Isa:9:6": {
    "footnotes": [
      "'A child is born... and his name shall be called Wonderful, Counsellor, God the Mighty, the Father of the world to come, the Prince of Peace.'",
      "Divine titles applied to a human child: the mystery of the Incarnation stated centuries before Christ's birth.",
      "'God the Mighty' (El Gibbor)—an unmistakably divine title. The Messiah is God."
    ]
  },
  "Isa:11:1": {
    "footnotes": [
      "'A rod out of the root of Jesse'—the Messiah comes from David's line. 'Root' indicates He is both descendant and source of Jesse's house.",
      "Christ is the branch (netzer) from which 'Nazarene' may derive (Matt 2:23)."
    ]
  },
  "Isa:40:3": {
    "footnotes": [
      "'The voice of one crying in the desert: Prepare ye the way of the Lord'—applied to John the Baptist (Matt 3:3, Mark 1:3).",
      "In the original context, 'the Lord' is Yahweh. The Gospels apply this to Jesus, identifying Him with Yahweh."
    ]
  },
  "Isa:42:1": {
    "footnotes": [
      "'Behold my servant... my elect, my soul delighteth in him'—the first Servant Song. Echoed at Jesus's baptism: 'This is my beloved Son, in whom I am well pleased' (Matt 3:17)."
    ]
  },
  "Isa:52:13": {
    "footnotes": [
      "'My servant shall be exalted and extolled'—the fourth Servant Song (52:13-53:12) begins with exaltation, then describes suffering, then vindication.",
      "The paradox of the Cross: exaltation through humiliation, glory through suffering."
    ]
  },
  "Isa:52:14": {
    "footnotes": [
      "'His visage was so marred more than any man'—the disfigurement of the Servant anticipates Christ's scourging and crucifixion."
    ]
  },
  "Isa:53:1": {
    "footnotes": [
      "'Who hath believed our report?'—John 12:38 quotes this to explain why many did not believe despite Christ's signs.",
      "The Servant's suffering was a stumbling block; it contradicted expectations of a glorious Messiah."
    ]
  },
  "Isa:53:3": {
    "footnotes": [
      "'Despised, and the most abject of men, a man of sorrows'—Jesus was rejected by His own, condemned by leaders, abandoned by disciples."
    ]
  },
  "Isa:53:4": {
    "footnotes": [
      "'Surely he hath borne our infirmities and carried our sorrows'—Matthew 8:17 applies this to Christ's healing ministry.",
      "The Servant bears not only sin but sickness; redemption includes the whole person."
    ]
  },
  "Isa:53:5": {
    "footnotes": [
      "'He was wounded for our iniquities, he was bruised for our sins'—vicarious atonement clearly stated. He suffers in our place.",
      "'By his bruises we are healed'—1 Peter 2:24 quotes this: 'By whose stripes you were healed.'"
    ]
  },
  "Isa:53:6": {
    "footnotes": [
      "'The Lord hath laid on him the iniquity of us all'—the sins of humanity transferred to the Servant. Substitutionary atonement."
    ]
  },
  "Isa:53:7": {
    "footnotes": [
      "'He was offered because it was his own will... as a lamb before his shearer'—Christ goes willingly to death, silent before His accusers (Matt 26:63).",
      "'Lamb to the slaughter'—the background to John's 'Behold the Lamb of God' (John 1:29). The Servant is the Paschal victim."
    ]
  },
  "Isa:53:8": {
    "footnotes": [
      "'He was cut off out of the land of the living'—He dies. 'For the wickedness of my people have I struck him'—for our sins."
    ]
  },
  "Isa:53:9": {
    "footnotes": [
      "'He hath given the ungodly for his burial, and the rich for his death'—Jesus was crucified with criminals but buried in a rich man's tomb (Joseph of Arimathea).",
      "'No iniquity in his mouth'—He was sinless, fulfilling 1 Peter 2:22."
    ]
  },
  "Isa:53:10": {
    "footnotes": [
      "'If he shall lay down his life for sin, he shall see a long-lived seed'—after death, the Servant lives to see spiritual offspring. The resurrection implied.",
      "His death is a 'guilt offering' (asham)—sacrificial terminology. Christ's death is a true sacrifice."
    ]
  },
  "Isa:53:11": {
    "footnotes": [
      "'By his knowledge shall this my just servant justify many'—justification comes through the Servant. He makes many righteous.",
      "'He shall bear their iniquities'—imputation of sin to the Servant, bearing what we deserved."
    ]
  },
  "Isa:53:12": {
    "footnotes": [
      "'He was reputed with the wicked'—fulfilled in Luke 22:37. Jesus was crucified between two criminals.",
      "'He hath borne the sins of many, and hath prayed for the transgressors'—'Father, forgive them' (Luke 23:34)."
    ]
  },
  "Isa:61:1": {
    "footnotes": [
      "'The Spirit of the Lord is upon me, because the Lord hath anointed me'—Jesus reads this in Nazareth and declares: 'This day is this scripture fulfilled' (Luke 4:18-21).",
      "Christ is the Anointed One (Messiah/Christos), anointed with the Spirit to preach good news and liberate."
    ]
  }
}
