{
  "Jas:2:14": {
    "footnotes": [
      "St. James asks whether faith 'alone' (without works) can save—the only occurrence of 'faith alone' in Scripture, and it is denied.",
      "This rhetorical question expects the answer 'No'—faith that produces no works is insufficient for salvation."
    ]
  },
  "Jas:2:17": {
    "footnotes": [
      "'Faith, if it have not works, is dead in itself'—dead faith is not saving faith; genuine faith is necessarily productive of good works.",
      "St. Thomas Aquinas, STh II-II, q.4, a.4: Faith without charity is 'unformed' (informis) and does not justify."
    ]
  },
  "Jas:2:19": {
    "footnotes": [
      "Even demons possess intellectual assent to truth ('the devils believe and tremble'), yet this does not save them.",
      "Saving faith must be 'faith working through love' (Gal 5:6), not mere intellectual acknowledgment."
    ]
  },
  "Jas:2:21": {
    "footnotes": [
      "'Was not Abraham our father justified by works?'—James affirms justification 'by works' in the sense of works flowing from living faith.",
      "This does not contradict Paul (Rom 4), who speaks of justification by faith apart from works of the Law as the initial principle; James speaks of the ongoing life of faith that must bear fruit."
    ]
  },
  "Jas:2:24": {
    "footnotes": [
      "'By works a man is justified, and not by faith only'—the only verse in Scripture explicitly stating 'not by faith only.'",
      "Council of Trent, Session VI, Canon 9: 'If anyone says that the sinner is justified by faith alone... let him be anathema.'",
      "The Catholic synthesis: we are justified by grace through faith, and that faith, if living, necessarily produces works of love."
    ]
  },
  "Jas:2:26": {
    "footnotes": [
      "'As the body without the spirit is dead, so also faith without works is dead'—works are to faith what the soul is to the body: its animating principle.",
      "Dead faith, like a corpse, has the appearance of faith but lacks its life-giving power."
    ]
  },
  "Jas:5:14": {
    "footnotes": [
      "'Let him bring in the priests of the church'—the sacrament of Anointing of the Sick is here instituted, to be administered by ordained priests.",
      "Council of Trent, Session XIV: This verse is 'the foundation of the sacrament of Extreme Unction.'"
    ]
  },
  "Jas:5:15": {
    "footnotes": [
      "'The prayer of faith shall save the sick man... and if he be in sins, they shall be forgiven him'—the anointing effects both physical healing (when God wills) and forgiveness of sins.",
      "The sacramental nature is evident: an outward sign (anointing with oil) conferring inward grace (healing and forgiveness)."
    ]
  },
  "Jas:5:16": {
    "footnotes": [
      "'Confess therefore your sins one to another'—auricular confession to priests, not merely general acknowledgment, is supported by the context of vv. 14-15 where priests minister sacramentally."
    ]
  }
}
