{
  "John:1:1": {
    "footnotes": [
      "'In the beginning'—the identical opening to Genesis 1:1, signaling a new creation narrative. John reveals that the Word was present at the first creation.",
      "'The Word' (Gr. Logos)—a term rich in both Jewish (God's creative speech, Wisdom personified) and Greek (rational principle of the cosmos) thought. Christ is both.",
      "'The Word was with God' (pros ton theon)—pros implies face-to-face relationship, eternal communion between distinct persons.",
      "'The Word was God' (theos ēn ho logos)—not 'a god' but fully divine. The Word shares the divine nature while being personally distinct from the Father."
    ]
  },
  "John:1:3": {
    "footnotes": [
      "'All things were made by him'—the Logos is the agent of all creation, identifying Him with the Creator God of Genesis.",
      "'Without him was made nothing'—excludes any created being from the category 'Logos'; the Word is uncreated, eternal God."
    ]
  },
  "John:1:4": {
    "footnotes": [
      "'In him was life'—the Logos is not merely alive but is Life itself, the source of all biological and spiritual life.",
      "'The light of men'—anticipates the 'I am the light of the world' declaration (8:12). Christ enlightens every human conscience and intellect."
    ]
  },
  "John:1:5": {
    "footnotes": [
      "'The darkness did not comprehend it'—Gr. katelaben can mean both 'comprehend' (understand) and 'overcome.' The darkness neither grasps nor conquers the Light."
    ]
  },
  "John:1:14": {
    "footnotes": [
      "'The Word was made flesh' (sarx egeneto)—the Incarnation stated with maximal directness. The eternal Logos assumed complete human nature.",
      "'Dwelt among us' (eskēnōsen)—literally 'tabernacled.' Christ's body is the new Temple, the locus of God's dwelling with His people (cf. 2:19-21).",
      "'Full of grace and truth'—echoes Exodus 34:6, where God reveals Himself to Moses as 'abounding in steadfast love and faithfulness.' Jesus is Yahweh incarnate."
    ]
  },
  "John:1:29": {
    "footnotes": [
      "'Behold the Lamb of God'—John the Baptist identifies Jesus with the Passover lamb (Exod 12) whose blood saves from death.",
      "Also evokes Isaiah 53:7, the suffering servant 'led as a lamb to the slaughter.' Jesus is both Passover sacrifice and sin-offering.",
      "The timing is significant: Jesus is crucified as the Passover lambs are being slaughtered in the Temple (John 19:14)."
    ]
  },
  "John:2:4": {
    "footnotes": [
      "'My hour is not yet come'—'the hour' in John always refers to Christ's passion, death, and glorification (cf. 7:30, 8:20, 12:23, 13:1, 17:1).",
      "Mary's intercession at Cana anticipates her role at 'the hour'—standing at the Cross (19:25-27).",
      "'Woman' (gynai)—not disrespectful but formal, connecting Mary to 'the woman' of Genesis 3:15 and Revelation 12:1."
    ]
  },
  "John:2:11": {
    "footnotes": [
      "'This beginning of miracles'—the first 'sign' (sēmeion). John's signs are not mere wonders but revelations of Christ's identity and mission.",
      "Water to wine at a wedding: Christ transforms the old covenant (water of Jewish purification, v. 6) into the new (wine of the Eucharist and messianic banquet).",
      "The abundance of wine (120-180 gallons) fulfills prophetic expectations of messianic plenty (Amos 9:13-14, Joel 3:18)."
    ]
  },
  "John:3:14": {
    "footnotes": [
      "'As Moses lifted up the serpent'—refers to Numbers 21:8-9, where Israelites bitten by serpents were healed by looking at the bronze serpent.",
      "The bronze serpent is a type of Christ: lifted up on a pole (the Cross), He becomes the source of healing for all who look to Him in faith.",
      "St. Augustine: 'What is the serpent lifted up? The death of the Lord on the Cross.'"
    ]
  },
  "John:8:24": {
    "footnotes": [
      "'If you believe not that I am he, you shall die in your sin'—'I am he' (egō eimi) echoes the divine name revealed to Moses (Exod 3:14).",
      "Jesus claims the name of Yahweh for Himself, the ultimate revelation of His divinity."
    ]
  },
  "John:8:58": {
    "footnotes": [
      "'Before Abraham was made, I AM' (egō eimi)—grammatically striking: 'was made' (genesthai, becoming) contrasts with 'I AM' (eimi, eternal being).",
      "Jesus claims not merely pre-existence but eternal, divine existence—the name Yahweh ('I AM WHO AM') from Exodus 3:14.",
      "The Jews understood perfectly: they took up stones (v. 59) because He claimed to be God, which they considered blasphemy."
    ]
  },
  "John:10:30": {
    "footnotes": [
      "'I and the Father are one' (hen esmen)—'one' is neuter (one thing, one reality) not masculine (one person). Unity of nature, distinction of persons.",
      "The Jews again take up stones (v. 31), understanding this as a claim to divinity: 'thou, being a man, makest thyself God' (v. 33)."
    ]
  },
  "John:14:6": {
    "footnotes": [
      "'I am the way, the truth, and the life'—three absolute claims. Christ is not a way but the way; not a truth but truth itself; not alive but Life itself.",
      "'No man cometh to the Father but by me'—the exclusivity of Christ as mediator. Salvation is found in no other name (Acts 4:12)."
    ]
  },
  "John:19:34": {
    "footnotes": [
      "'Blood and water'—the Fathers see here the birth of the Church and her sacraments: baptism (water) and Eucharist (blood) flowing from Christ's side.",
      "As Eve was formed from Adam's side in sleep, so the Church (the new Eve) is born from the side of the new Adam in the sleep of death.",
      "Cf. 1 John 5:6-8, which connects water, blood, and Spirit as witnesses to Christ."
    ]
  },
  "John:20:28": {
    "footnotes": [
      "'My Lord and my God' (ho kyrios mou kai ho theos mou)—Thomas's confession is the clearest declaration of Christ's divinity in the Gospels.",
      "Jesus accepts this worship without correction, confirming that He is indeed Lord and God."
    ]
  },
  "John:6:51": {
    "footnotes": [
      "Christ shifts from 'bread' metaphor to explicit 'flesh' (Gr. sarx), the same term used for the Incarnation in John 1:14.",
      "Cf. St. Cyril of Alexandria: 'He did not say \"signifies\" but \"is\" my flesh.'"
    ]
  },
  "John:6:54": {
    "footnotes": [
      "The Greek trōgō (to gnaw, chew) emphasizes physical eating, not mere spiritual reception.",
      "St. Thomas Aquinas, STh III, q.75, a.1: The body of Christ is truly, really, and substantially present under the species of bread and wine."
    ]
  },
  "John:6:56": {
    "footnotes": [
      "The mutual indwelling ('he in me, and I in him') describes the ontological union effected by worthy reception of the Eucharist."
    ]
  },
  "John:6:66": {
    "footnotes": [
      "The departure of disciples confirms they understood Christ literally. Had He spoken metaphorically, He would have corrected the misunderstanding as elsewhere (cf. Matt 16:11-12)."
    ]
  },
  "John:21:15": {
    "footnotes": [
      "Christ's threefold commission to Peter corresponds to Peter's threefold denial, restoring him to apostolic office.",
      "The command 'Feed my lambs' (Gr. boske ta arnia) establishes Peter's pastoral authority over the entire flock."
    ]
  },
  "John:21:16": {
    "footnotes": [
      "'Tend my sheep' (Gr. poimaine ta probata) employs the verb for shepherding, indicating governing authority, not merely teaching."
    ]
  },
  "John:21:17": {
    "footnotes": [
      "The threefold repetition solemnly establishes Peter's unique pastoral commission over the universal Church.",
      "Cf. St. John Chrysostom, Hom. on John 88: 'Why does He pass over the others and speak of these things to Peter? He was the chosen one of the Apostles, the mouth of the disciples, the head of the choir.'"
    ]
  }
}
