{
  "Luke:22:19": {
    "footnotes": [
      "'Do this in remembrance of me' (touto poieite eis tēn emēn anamnēsin)—anamnēsis means a making-present, not mere psychological recollection.",
      "The command establishes the Eucharist as a perpetual sacrifice-memorial, fulfilled in the Mass."
    ]
  },
  "Luke:22:20": {
    "footnotes": [
      "'The new testament in my blood' (hē kainē diathēkē en tō haimati mou) echoes Exodus 24:8 and Jeremiah 31:31, establishing the Eucharist as the sacrifice of the New Covenant."
    ]
  },
  "Luke:22:31": {
    "footnotes": [
      "Christ prays specifically for Peter ('I have prayed for thee') that his faith not fail, distinguishing him from the other apostles.",
      "This prayer guarantees Peter's faith will be preserved for the sake of confirming his brethren—a basis for papal infallibility."
    ]
  },
  "Luke:22:32": {
    "footnotes": [
      "'Confirm thy brethren' (stērison tous adelphous sou)—Peter receives the mission to strengthen the faith of the other apostles and, by extension, the whole Church.",
      "Vatican I (Pastor Aeternus): This verse demonstrates that 'the Roman Pontiff... possesses infallibility in defining doctrine of faith or morals.'"
    ]
  },
  "Luke:1:28": {
    "footnotes": [
      "'Full of grace' (Lat. gratia plena; Gr. kecharitōmenē) is a perfect passive participle indicating Mary has been and remains completely graced.",
      "The angel's salutation replaces Mary's name with this title, indicating grace defines her very identity.",
      "St. Jerome, St. Augustine, and the Fathers understood this fullness as excluding all sin—the foundation for the Immaculate Conception."
    ]
  },
  "Luke:1:42": {
    "footnotes": [
      "'Blessed art thou among women'—Elizabeth, filled with the Holy Spirit, pronounces Mary blessed above all women, echoing Judges 5:24 (Jael) and Judith 13:18.",
      "The blessing extends to 'the fruit of thy womb,' connecting Mary's blessedness to her divine maternity."
    ]
  },
  "Luke:1:43": {
    "footnotes": [
      "'The mother of my Lord' (hē mētēr tou kyriou mou)—Elizabeth calls Mary 'mother of the Lord' (Kyrios = Yahweh in LXX usage), recognizing her as Theotokos.",
      "Council of Ephesus (431): Mary is truly 'God-bearer' (Theotokos) because Christ is one divine Person with two natures."
    ]
  },
  "Luke:1:48": {
    "footnotes": [
      "'All generations shall call me blessed'—a prophecy fulfilled in the Church's continuous veneration of Mary.",
      "This verse refutes those who claim Marian devotion is unbiblical innovation."
    ]
  },
  "Luke:24:27": {
    "footnotes": [
      "'Beginning at Moses and all the prophets, he expounded to them in all the scriptures, the things that were concerning him.'",
      "Christ Himself teaches that the entire Old Testament points to Him. Christological interpretation is not imposed but inherent.",
      "The Bible is a unified narrative with Christ as its center and goal."
    ]
  },
  "Luke:24:32": {
    "footnotes": [
      "'Was not our heart burning within us, whilst he spoke in the way, and opened to us the scriptures?'",
      "The proper effect of Scripture rightly understood: hearts set aflame. The Word is meant to kindle love, not merely inform."
    ]
  },
  "Luke:24:35": {
    "footnotes": [
      "'They knew him in the breaking of bread'—Christ is recognized in the Eucharist. The disciples' eyes are opened at the moment of fraction.",
      "The Emmaus narrative unites Word (vv. 27, 32) and Sacrament (v. 35)—the structure of the Mass."
    ]
  }
}
