{
  "Matt:26:26": {
    "footnotes": [
      "The copula 'is' (Gr. estin) bears its natural sense. Christ does not say 'this represents' or 'this signifies.'",
      "The Aramaic spoken by Christ would have been even more direct, lacking a copula entirely: 'This—my body.'"
    ]
  },
  "Matt:26:28": {
    "footnotes": [
      "The sacrificial language ('shed,' 'remission of sins') connects the Eucharist to the atoning sacrifice of Calvary, which it makes present (cf. Council of Trent, Session XXII)."
    ]
  },
  "Matt:16:18": {
    "footnotes": [
      "In Aramaic, Jesus said: 'Thou art Kepha, and upon this kepha I will build my church.' The wordplay is identical—Peter is the rock.",
      "Greek uses Petros (masculine) and petra (feminine) for grammatical reasons, but the underlying Aramaic is the same word.",
      "St. Augustine, Retractationes I.21: Though Augustine sometimes interpreted the rock as Christ or Peter's faith, he affirmed Peter as the rock representing the Church.",
      "The 'gates of hell' (portae inferi) refers to the powers of death and evil, which cannot overcome the Church founded on Peter."
    ]
  },
  "Matt:16:19": {
    "footnotes": [
      "The 'keys of the kingdom' symbolize supreme administrative authority, echoing Isaiah 22:22 where Eliakim receives the key of David's house.",
      "'Binding and loosing' (Heb. asar/hitir) was rabbinic terminology for authoritative doctrinal and disciplinary decisions.",
      "While all apostles receive binding/loosing power (Matt 18:18), only Peter receives the keys—indicating a unique primacy."
    ]
  },
  "Matt:12:32": {
    "footnotes": [
      "The distinction 'neither in this world, nor in the world to come' implies some sins can be forgiven after death—a basis for the doctrine of purgatory.",
      "St. Gregory the Great, Dialogues IV.39: 'It is to be believed that there is a purgatorial fire before the judgment for certain light sins.'"
    ]
  },
  "Matt:5:26": {
    "footnotes": [
      "'Till thou pay the last farthing' suggests temporal punishment due even after guilt is forgiven, paid either in this life or the next.",
      "St. Augustine and St. Gregory both cite this passage in support of purgatorial purification."
    ]
  },
  "Matt:5:17": {
    "footnotes": [
      "'I am not come to destroy, but to fulfil'—Christ does not abolish the Law but brings it to completion, revealing its deepest meaning.",
      "The Sermon on the Mount shows how the moral law finds its perfection in Christ's teaching."
    ]
  },
  "Matt:5:48": {
    "footnotes": [
      "'Be you therefore perfect, as also your heavenly Father is perfect'—the call to holiness. Perfection is possible by grace.",
      "This is not mere moral improvement but participation in divine holiness—theosis, becoming like God."
    ]
  },
  "Matt:3:17": {
    "footnotes": [
      "'This is my beloved Son, in whom I am well pleased'—the Trinity revealed at Christ's baptism: the Father's voice, the Son in the water, the Spirit descending.",
      "Echoes Isaiah 42:1 (the Servant) and Psalm 2:7 (the Son). Jesus is identified as both Suffering Servant and divine King."
    ]
  },
  "Matt:17:5": {
    "footnotes": [
      "'This is my beloved Son... hear ye him'—the Transfiguration confirms Christ's divinity. Moses and Elijah (Law and Prophets) defer to Him.",
      "'Hear ye him'—Jesus supersedes Moses. The new lawgiver is to be obeyed above the old."
    ]
  },
  "Matt:28:18": {
    "footnotes": [
      "'All power is given to me in heaven and in earth'—the risen Christ claims universal authority, fulfilling Daniel 7:14.",
      "This authority grounds the Great Commission: the apostles go forth in His name, with His power."
    ]
  },
  "Matt:28:19": {
    "footnotes": [
      "'Baptizing them in the name of the Father, and of the Son, and of the Holy Ghost'—the Trinitarian formula. One 'name' (singular), three Persons.",
      "Baptism incorporates into the life of the Trinity, not merely into a human organization."
    ]
  },
  "Matt:28:20": {
    "footnotes": [
      "'I am with you all days, even to the consummation of the world'—Christ's abiding presence with the Church guarantees its indefectibility.",
      "The Church cannot fail because Christ Himself remains with her until the end."
    ]
  }
}
