{
  "Matt:26:26": {
    "footnotes": [
      "The copula 'is' (Gr. estin) bears its natural sense. Christ does not say 'this represents' or 'this signifies.'",
      "The Aramaic spoken by Christ would have been even more direct, lacking a copula entirely: 'This—my body.'"
    ]
  },
  "Matt:26:28": {
    "footnotes": [
      "The sacrificial language ('shed,' 'remission of sins') connects the Eucharist to the atoning sacrifice of Calvary, which it makes present (cf. Council of Trent, Session XXII)."
    ]
  },
  "Matt:16:18": {
    "footnotes": [
      "The Aramaic Kepha (rock) underlies both 'Peter' and 'rock'—Christ declares: 'Thou art Rock, and upon this rock I will build my church.'",
      "St. Augustine, Retractationes I.21: Though Augustine sometimes interpreted the rock as Christ or Peter's faith, he affirmed Peter as the rock representing the Church.",
      "The 'gates of hell' (portae inferi) refers to the powers of death and evil, which cannot overcome the Church founded on Peter."
    ]
  },
  "Matt:16:19": {
    "footnotes": [
      "The 'keys of the kingdom' symbolize supreme administrative authority, echoing Isaiah 22:22 where Eliakim receives the key of David's house.",
      "'Binding and loosing' (Heb. asar/hitir) was rabbinic terminology for authoritative doctrinal and disciplinary decisions.",
      "While all apostles receive binding/loosing power (Matt 18:18), only Peter receives the keys—indicating a unique primacy."
    ]
  },
  "Matt:12:32": {
    "footnotes": [
      "The distinction 'neither in this world, nor in the world to come' implies some sins can be forgiven after death—a basis for the doctrine of purgatory.",
      "St. Gregory the Great, Dialogues IV.39: 'It is to be believed that there is a purgatorial fire before the judgment for certain light sins.'"
    ]
  },
  "Matt:5:26": {
    "footnotes": [
      "'Till thou pay the last farthing' suggests temporal punishment due even after guilt is forgiven, paid either in this life or the next.",
      "St. Augustine and St. Gregory both cite this passage in support of purgatorial purification."
    ]
  }
}
