{
  "Phil:2:5": {
    "footnotes": [
      "The 'Christ Hymn' (vv. 5-11) is one of the earliest Christological texts, possibly a pre-Pauline liturgical hymn.",
      "Paul introduces it as an ethical model, but its theological content far exceeds mere moral example."
    ]
  },
  "Phil:2:6": {
    "footnotes": [
      "'Being in the form of God' (en morphē theou)—morphē denotes the essential attributes, not mere appearance. Christ possesses the divine nature.",
      "'A thing to be grasped' (harpagmon)—He did not regard His divine equality as something to be exploited or clung to selfishly.",
      "This presupposes Christ's pre-existence and divinity as the starting point of the narrative."
    ]
  },
  "Phil:2:7": {
    "footnotes": [
      "'Emptied himself' (heauton ekenōsen)—the kenosis. Christ did not empty Himself of divinity but of divine glory and prerogatives.",
      "'Form of a servant'—the same word morphē used of His divine form. He truly assumed human nature, not merely its appearance.",
      "The Incarnation is a descent: from equality with God to the condition of a slave."
    ]
  },
  "Phil:2:8": {
    "footnotes": [
      "'Obedient unto death, even the death of the cross'—the lowest point of the descent. Crucifixion was reserved for slaves and criminals, the most shameful death.",
      "Christ's obedience undoes Adam's disobedience (Rom 5:19)."
    ]
  },
  "Phil:2:9": {
    "footnotes": [
      "'God hath exalted him'—the resurrection and ascension. The descent is answered by supreme exaltation.",
      "'A name which is above every name'—the divine name, Kyrios (Lord), equivalent to Yahweh in the Greek OT."
    ]
  },
  "Phil:2:10": {
    "footnotes": [
      "'Every knee should bow'—quotes Isaiah 45:23, where Yahweh declares that every knee shall bow to Him. Paul applies this to Jesus.",
      "'In heaven, on earth, under the earth'—the entire cosmos, including the dead, acknowledges Christ's lordship."
    ]
  },
  "Phil:2:11": {
    "footnotes": [
      "'Jesus Christ is Lord' (Kyrios Iēsous Christos)—the earliest Christian confession. Kyrios is the name of God in the Greek Old Testament.",
      "'To the glory of God the Father'—Christ's lordship does not rival but reveals the Father's glory."
    ]
  }
}
