{
  "Ps:22:1": {
    "footnotes": [
      "'O God my God, why hast thou forsaken me?'—the opening words Jesus cries from the Cross (Matt 27:46). He prays this psalm as He dies.",
      "By quoting the opening, Jesus invokes the entire psalm—including its conclusion of vindication and universal worship.",
      "The psalm moves from utter desolation to triumphant praise, tracing the arc from crucifixion to resurrection."
    ]
  },
  "Ps:22:6": {
    "footnotes": [
      "'I am a worm, and no man: the reproach of men'—Christ was despised and rejected, mocked as He hung on the Cross.",
      "The 'worm' (tola'ath) is the crimson worm from which scarlet dye was made—crushed to produce red color, an image of Christ's blood."
    ]
  },
  "Ps:22:7": {
    "footnotes": [
      "'They have spoken with the lips, and wagged the head'—fulfilled in Matthew 27:39: 'They that passed by, blasphemed him, wagging their heads.'"
    ]
  },
  "Ps:22:8": {
    "footnotes": [
      "'He hoped in the Lord, let him deliver him'—the exact taunt of the chief priests: 'He trusted in God; let him now deliver him' (Matt 27:43)."
    ]
  },
  "Ps:22:14": {
    "footnotes": [
      "'I am poured out like water, and all my bones are scattered'—describes the physical trauma of crucifixion: dehydration, joint dislocation from hanging."
    ]
  },
  "Ps:22:16": {
    "footnotes": [
      "'They have dug my hands and feet'—the Hebrew is difficult, but the LXX and many manuscripts read 'pierced' (ōryxan).",
      "This describes crucifixion a thousand years before it was invented as a method of execution. David could not have known this naturally."
    ]
  },
  "Ps:22:17": {
    "footnotes": [
      "'They have numbered all my bones'—the victim's bones visible due to stretching on the cross, none broken (cf. John 19:36)."
    ]
  },
  "Ps:22:18": {
    "footnotes": [
      "'They parted my garments amongst them; and upon my vesture they cast lots'—fulfilled precisely in John 19:23-24. The soldiers divided His garments and cast lots for His tunic.",
      "John explicitly cites this psalm as fulfilled in the crucifixion."
    ]
  },
  "Ps:22:27": {
    "footnotes": [
      "'All the ends of the earth shall remember, and shall be converted to the Lord'—the psalm moves from suffering to universal salvation.",
      "Christ's passion leads to the conversion of all nations, the mission to the Gentiles."
    ]
  },
  "Ps:22:31": {
    "footnotes": [
      "'They shall declare his justice to a people that shall be born'—the Good News will be proclaimed to future generations born after these events."
    ]
  },
  "Ps:110:1": {
    "footnotes": [
      "'The Lord said to my Lord: Sit thou at my right hand'—Jesus uses this verse to demonstrate the Messiah's divinity (Matt 22:41-46).",
      "If David calls the Messiah 'Lord,' the Messiah cannot be merely David's human descendant; He must be divine.",
      "This is the most quoted OT verse in the NT, applied to Christ's exaltation and session at the Father's right hand."
    ]
  },
  "Ps:110:4": {
    "footnotes": [
      "'Thou art a priest for ever according to the order of Melchisedech'—the Messiah is both king (v. 1) and priest, but not of the Levitical order.",
      "Hebrews develops this: Christ's eternal priesthood supersedes the Aaronic priesthood. He offers His own sacrifice once for all."
    ]
  },
  "Ps:2:7": {
    "footnotes": [
      "'Thou art my son, this day have I begotten thee'—cited at Jesus's baptism (Matt 3:17) and applied to the resurrection (Acts 13:33, Heb 1:5).",
      "The 'begetting' refers to the eternal generation of the Son and His manifestation as Messiah-King."
    ]
  },
  "Ps:16:10": {
    "footnotes": [
      "'Thou wilt not leave my soul in hell; nor wilt thou give thy holy one to see corruption.'",
      "Peter at Pentecost (Acts 2:27-31) applies this to Christ's resurrection: David's body saw corruption, but Christ's did not.",
      "Proof of the resurrection: the Holy One's body would not decay in the tomb."
    ]
  },
  "Ps:69:21": {
    "footnotes": [
      "'They gave me gall for my food, and in my thirst they gave me vinegar to drink'—fulfilled at the crucifixion (Matt 27:34, John 19:28-30)."
    ]
  },
  "Ps:45:6": {
    "footnotes": [
      "'Thy throne, O God, is for ever and ever'—addressed to the Davidic king, yet called 'God.' Applied to Christ in Hebrews 1:8.",
      "The Messiah is both Davidic king and divine—a truth the psalm holds in tension, resolved in the Incarnation."
    ]
  }
}
