{
  "Rom:2:6": {
    "footnotes": [
      "'Who will render to every man according to his works'—final judgment is according to works, indicating works are integral to salvation, not merely its evidence.",
      "Cf. Matt 25:31-46, where the sheep and goats are separated based on works of mercy."
    ]
  },
  "Rom:2:13": {
    "footnotes": [
      "'Not the hearers of the law are just before God, but the doers of the law shall be justified'—justification involves actual righteousness, not mere imputation.",
      "This verse refutes the notion that works play no role in justification."
    ]
  },
  "Rom:3:28": {
    "footnotes": [
      "'A man is justified by faith, without the works of the law'—Paul contrasts faith with 'works of the law' (Mosaic observances), not with all works.",
      "Luther's addition of 'alone' (allein) in his German translation has no basis in the Greek text (pistei, 'by faith').",
      "The Council of Trent and Catholic teaching affirm justification by grace through faith while denying justification by 'faith alone' without love."
    ]
  },
  "Rom:4:3": {
    "footnotes": [
      "Abraham's faith 'was reputed to him unto justice'—faith is the instrumental cause of justification, by which we receive grace.",
      "Paul here discusses initial justification; James 2:21-24 discusses how Abraham was further 'justified by works' throughout his life of faith."
    ]
  },
  "Rom:5:5": {
    "footnotes": [
      "'The charity of God is poured forth in our hearts, by the Holy Ghost'—justification involves an infusion of charity (love), making the soul truly righteous.",
      "This internal transformation distinguishes Catholic theology from forensic-only views of justification."
    ]
  },
  "Rom:6:3": {
    "footnotes": [
      "'Baptized into Christ Jesus... baptized into his death'—baptism effects real union with Christ's death and resurrection, not merely symbolizes it.",
      "Baptismal regeneration: the sacrament truly conveys the grace it signifies."
    ]
  },
  "Rom:6:4": {
    "footnotes": [
      "'We are buried together with him by baptism unto death'—the imagery of burial and rising indicates an ontological change, a real death to sin and new life in Christ.",
      "Cf. Titus 3:5, 'the laver of regeneration.'"
    ]
  },
  "Rom:8:17": {
    "footnotes": [
      "'If sons, heirs also... yet so, if we suffer with him'—inheritance is conditional upon suffering with Christ; salvation requires perseverance and cooperation with grace."
    ]
  },
  "Rom:11:22": {
    "footnotes": [
      "'Otherwise thou also shalt be cut off'—Paul warns believers that they can fall from grace if they do not continue in God's goodness.",
      "This refutes the doctrine of 'once saved, always saved.'"
    ]
  }
}
